; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v3 - type_1 ?v8 - type_3)
 	      (pred_4 ?v7 - object ?v8 - type_3)
	      (pred_2 ?v3 - type_1 ?v1 - type_2)
	      (pred_1 ?v3 - type_1 ?v7 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v3 - type_1 ?v2 ?v4 - type_3)
       :precondition (and  (pred_3 ?v3 ?v2))
       :effect (and  (pred_3 ?v3 ?v4)
		     (not (pred_3 ?v3 ?v2))))

   (:action op_2
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v6) (pred_3 ?v3 ?v6) (pred_2 ?v3 ?v1))
       :effect (and (pred_1 ?v3 ?v5 ?v1)
		    (not (pred_4 ?v5 ?v6)) 
		    (not (pred_2 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v5 ?v1) (pred_3 ?v3 ?v6))
       :effect (and (pred_4 ?v5 ?v6)
		    (pred_2 ?v3 ?v1)
		    (not (pred_1 ?v3 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_09 - type_1
obj_08 obj_14 obj_07 obj_01 - type_2
obj_13 obj_12 obj_05 obj_04 - type_3
obj_06 obj_03 obj_10 obj_11 - object)
(:init
(pred_3 obj_02 obj_12)
(pred_2 obj_02 obj_08)
(pred_2 obj_02 obj_14)
(pred_3 obj_09 obj_04)
(pred_2 obj_09 obj_07)
(pred_2 obj_09 obj_01)
(pred_4 obj_06 obj_12)
(pred_4 obj_03 obj_05)
(pred_4 obj_10 obj_12)
(pred_4 obj_11 obj_13)
)
(:goal
(and
(pred_4 obj_06 obj_05)
(pred_4 obj_03 obj_13)
(pred_4 obj_10 obj_12)
(pred_4 obj_11 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_05)))
)
)

; plan
1. (op_2 obj_02 obj_06 obj_12 obj_14)
   deleted: (pred_4 obj_06 obj_12) (pred_2 obj_02 obj_14)
   added: (pred_1 obj_02 obj_06 obj_14)
   goals met: 1 of 4
2. (op_3 obj_09 obj_04 obj_13)
   deleted: (pred_3 obj_09 obj_04)
   added: (pred_3 obj_09 obj_13)
   goals met: 1 of 4
3. (op_2 obj_09 obj_11 obj_13 obj_01)
   deleted: (pred_4 obj_11 obj_13) (pred_2 obj_09 obj_01)
   added: (pred_1 obj_09 obj_11 obj_01)
   goals met: 1 of 4
4. (op_3 obj_02 obj_12 obj_13)
   deleted: (pred_3 obj_02 obj_12)
   added: (pred_3 obj_02 obj_13)
   goals met: 1 of 4
5. (op_3 obj_09 obj_13 obj_04)
   deleted: (pred_3 obj_09 obj_13)
   added: (pred_3 obj_09 obj_04)
   goals met: 1 of 4
6. (op_1 obj_02 obj_06 obj_13 obj_14)
   deleted: (pred_1 obj_02 obj_06 obj_14)
   added: (pred_4 obj_06 obj_13) (pred_2 obj_02 obj_14)
   goals met: 1 of 4
7. (op_1 obj_09 obj_11 obj_04 obj_01)
   deleted: (pred_1 obj_09 obj_11 obj_01)
   added: (pred_4 obj_11 obj_04) (pred_2 obj_09 obj_01)
   goals met: 2 of 4
8. (op_3 obj_09 obj_04 obj_05)
   deleted: (pred_3 obj_09 obj_04)
   added: (pred_3 obj_09 obj_05)
   goals met: 2 of 4
9. (op_2 obj_09 obj_03 obj_05 obj_01)
   deleted: (pred_4 obj_03 obj_05) (pred_2 obj_09 obj_01)
   added: (pred_1 obj_09 obj_03 obj_01)
   goals met: 2 of 4
10. (op_3 obj_09 obj_05 obj_13)
   deleted: (pred_3 obj_09 obj_05)
   added: (pred_3 obj_09 obj_13)
   goals met: 2 of 4
11. (op_1 obj_09 obj_03 obj_13 obj_01)
   deleted: (pred_1 obj_09 obj_03 obj_01)
   added: (pred_4 obj_03 obj_13) (pred_2 obj_09 obj_01)
   goals met: 3 of 4
12. (op_2 obj_09 obj_06 obj_13 obj_01)
   deleted: (pred_4 obj_06 obj_13) (pred_2 obj_09 obj_01)
   added: (pred_1 obj_09 obj_06 obj_01)
   goals met: 3 of 4
13. (op_3 obj_09 obj_13 obj_05)
   deleted: (pred_3 obj_09 obj_13)
   added: (pred_3 obj_09 obj_05)
   goals met: 3 of 4
14. (op_1 obj_09 obj_06 obj_05 obj_01)
   deleted: (pred_1 obj_09 obj_06 obj_01)
   added: (pred_4 obj_06 obj_05) (pred_2 obj_09 obj_01)
   goals met: 4 of 4
